In [1]:
import pandas as pd

In [6]:
df = pd.DataFrame (
    {
        "Name" : [
            "둘리", 
            "코난",
            "봄",
        ],
        "Age" : [22, 35, 32], 
        "Sex" : ["남", "남", "여"],
    }
)

In [7]:
df

  Name  Age Sex
0   둘리   22   남
1   코난   35   남
2    봄   32   여

__DataFrame__ 다양한 타입의 데이터를 저장할 수 있는 2차원의 데이터 구조이다.  
  
스프레드시트, SQL 테이블, R의 data.frame과 유사하다.  
  
![스프레드시트](https://pandas.pydata.org/docs/_images/01_table_spreadsheet.png)

__DataFram__ 의 각 칼럼은 __Series__ 이다.
![시리즈](https://pandas.pydata.org/docs/_images/01_table_series.svg)

__Age__ 칼럼의 데이터를 다루고 싶다면

In [8]:
df["Age"]

0    22
1    35
2    32
Name: Age, dtype: int64

__DataFrame__ 에서 하나의 칼럼을 선택하면, 그 결과는 __Series__ 이다.  
하나의 칼럼을 선택하려면 네모 괄호 안에 [ ] 칼럼 라벨을 적어주면 된다.
  
하나의 __Series__ 를 생성하려면 다음과 같이...

In [14]:
ages = pd.Series([22, 52, 32], name="Age")

In [11]:
ages

0    22
1    35
2    32
Name: Age, dtype: int64

In [12]:
df["Age"].max()

35

In [15]:
ages.max()

52

In [16]:
df.describe()

             Age
count   3.000000
mean   29.666667
std     6.806859
min    22.000000
25%    27.000000
50%    32.000000
75%    33.500000
max    35.000000

# 이건가  
- 이렇게